## Terraform plan (envs/dev)\n| Parameter | Value |\n|-----------|-------|\n| Lifecycle | `ephemeral` |\n| Build ID | `15-01-26-15` |\n| State Key | `envs/dev/builds/15-01-26-15/terraform.tfstate` |\n<details>\n<summary>Plan summary</summary>\n<pre>\ncreate:  71\nupdate:  0\ndelete:  0\nreplace: 0\nread:    7\nno_op:   0\n</pre>\n</details>\n<details>\n<summary>Full plan (truncated)</summary>\n<pre>
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 &lt;= read (data resources)

Terraform will perform the following actions:

  # aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-15-01-26-15-nat-eip"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all             = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-15-01-26-15-nat-eip"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + vpc                  = (known after apply)
    }

  # aws_nat_gateway.this will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-15-01-26-15-nat"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                           = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-15-01-26-15-nat"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # kubernetes_namespace_v1.external_secrets[0] will be created
  + resource "kubernetes_namespace_v1" "external_secrets" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "external-secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account_v1.aws_load_balancer_controller[0] will be created
  + resource "kubernetes_service_account_v1" "aws_load_balancer_controller" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "aws-load-balancer-controller"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account_v1.cluster_autoscaler[0] will be created
  + resource "kubernetes_service_account_v1" "cluster_autoscaler" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "cluster-autoscaler"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account_v1.external_secrets[0] will be created
  + resource "kubernetes_service_account_v1" "external_secrets" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "external-secrets"
          + namespace        = "external-secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # null_resource.enforce_build_id_immutability[0] will be created
  + resource "null_resource" "enforce_build_id_immutability" {
      + id       = (known after apply)
      + triggers = {
          + "build_id"    = "15-01-26-15"
          + "environment" = "dev"
        }
    }

  # module.app_secrets["goldenpath/dev/backstage/secrets"].data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 &lt;= data "aws_iam_policy_document" "this" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement (known after apply)
    }

  # module.app_secrets["goldenpath/dev/backstage/secrets"].aws_secretsmanager_secret.this will be created
  + resource "aws_secretsmanager_secret" "this" {
      + arn                            = (known after apply)
      + description                    = "Backstage sensitive config (GitHub Token, OIDC)"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "goldenpath/dev/backstage/secrets"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 7
      + tags                           = {
          + "BuildId"              = "15-01-26-15"
          + "Environment"          = "dev"
          + "Lifecycle"            = "ephemeral"
          + "ManagedBy"            = "terraform"
          + "Owner"                = "platform-team"
          + "Project"              = "goldenpath-idp"
          + "goldenpath.idp/id"    = "SEC-BACKSTAGE-MAIN"
          + "goldenpath.idp/owner" = "platform-team"
          + "goldenpath.idp/risk"  = "high"
        }
      + tags_all                       = {
          + "BuildId"              = "15-01-26-15"
          + "Environment"          = "dev"
          + "Lifecycle"            = "ephemeral"
          + "ManagedBy"            = "terraform"
          + "Owner"                = "platform-team"
          + "Project"              = "goldenpath-idp"
          + "goldenpath.idp/id"    = "SEC-BACKSTAGE-MAIN"
          + "goldenpath.idp/owner" = "platform-team"
          + "goldenpath.idp/risk"  = "high"
        }

      + replica (known after apply)
    }

  # module.app_secrets["goldenpath/dev/backstage/secrets"].aws_secretsmanager_secret_policy.this[0] will be created
  + resource "aws_secretsmanager_secret_policy" "this" {
      + id         = (known after apply)
      + policy     = (known after apply)
      + secret_arn = (known after apply)
    }

  # module.app_secrets["goldenpath/dev/keycloak/admin"].data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 &lt;= data "aws_iam_policy_document" "this" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement (known after apply)
    }

  # module.app_secrets["goldenpath/dev/keycloak/admin"].aws_secretsmanager_secret.this will be created
  + resource "aws_secretsmanager_secret" "this" {
      + arn                            = (known after apply)
      + description                    = "Keycloak initial admin credentials"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "goldenpath/dev/keycloak/admin"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 7
      + tags                           = {
          + "BuildId"              = "15-01-26-15"
          + "Environment"          = "dev"
          + "Lifecycle"            = "ephemeral"
          + "ManagedBy"            = "terraform"
          + "Owner"                = "platform-team"
          + "Project"              = "goldenpath-idp"
          + "goldenpath.idp/id"    = "SEC-KEYCLOAK-ADMIN"
          + "goldenpath.idp/owner" = "platform-team"
          + "goldenpath.idp/risk"  = "low"
        }
      + tags_all                       = {
          + "BuildId"              = "15-01-26-15"
          + "Environment"          = "dev"
          + "Lifecycle"            = "ephemeral"
          + "ManagedBy"            = "terraform"
          + "Owner"                = "platform-team"
          + "Project"              = "goldenpath-idp"
          + "goldenpath.idp/id"    = "SEC-KEYCLOAK-ADMIN"
          + "goldenpath.idp/owner" = "platform-team"
          + "goldenpath.idp/risk"  = "low"
        }

      + replica (known after apply)
    }

  # module.app_secrets["goldenpath/dev/keycloak/admin"].aws_secretsmanager_secret_policy.this[0] will be created
  + resource "aws_secretsmanager_secret_policy" "this" {
      + id         = (known after apply)
      + policy     = (known after apply)
      + secret_arn = (known after apply)
    }

  # module.compute[0].aws_instance.app will be created
  + resource "aws_instance" "app" {
      + ami                                  = "ami-0a0ff88d0f3f85a14"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-app"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                             = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-app"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface {
          + delete_on_termination = false
          + device_index          = 0
          + network_card_index    = 0
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = "gp3"
        }
    }

  # module.compute[0].aws_network_interface.instance will be created
  + resource "aws_network_interface" "instance" {
      + arn                       = (known after apply)
      + description               = "Golden Path dev instance"
      + enable_primary_ipv6       = (known after apply)
      + id                        = (known after apply)
      + interface_type            = (known after apply)
      + ipv4_prefix_count         = (known after apply)
      + ipv4_prefixes             = (known after apply)
      + ipv6_address_count        = (known after apply)
      + ipv6_address_list         = (known after apply)
      + ipv6_address_list_enabled = false
      + ipv6_addresses            = (known after apply)
      + ipv6_prefix_count         = (known after apply)
      + ipv6_prefixes             = (known after apply)
      + mac_address               = (known after apply)
      + outpost_arn               = (known after apply)
      + owner_id                  = (known after apply)
      + private_dns_name          = (known after apply)
      + private_ip                = (known after apply)
      + private_ip_list           = (known after apply)
      + private_ip_list_enabled   = false
      + private_ips               = (known after apply)
      + private_ips_count         = (known after apply)
      + security_groups           = (known after apply)
      + source_dest_check         = true
      + subnet_id                 = (known after apply)
      + tags                      = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-app-eni"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                  = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-app-eni"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }

      + attachment (known after apply)
    }

  # module.eks[0].data.tls_certificate.oidc will be read during apply
  # (config refers to values not yet known)
 &lt;= data "tls_certificate" "oidc" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks[0].aws_eks_addon.coredns will be created
  + resource "aws_eks_addon" "coredns" {
      + addon_name                  = "coredns"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "goldenpath-dev-eks-15-01-26-15"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-15-01-26-15-coredns"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                    = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-15-01-26-15-coredns"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # module.eks[0].aws_eks_addon.ebs_csi_driver[0] will be created
  + resource "aws_eks_addon" "ebs_csi_driver" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "goldenpath-dev-eks-15-01-26-15"
      + configuration_values        = jsonencode(
            {
              + controller = {
                  + replicaCount = 1
                }
            }
        )
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-15-01-26-15-aws-ebs-csi-driver"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                    = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-15-01-26-15-aws-ebs-csi-driver"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # module.eks[0].aws_eks_addon.efs_csi_driver[0] will be created
  + resource "aws_eks_addon" "efs_csi_driver" {
      + addon_name                  = "aws-efs-csi-driver"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "goldenpath-dev-eks-15-01-26-15"
      + configuration_values        = jsonencode(
            {
              + controller = {
                  + replicaCount = 1
                }
            }
        )
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-15-01-26-15-aws-efs-csi-driver"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                    = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-15-01-26-15-aws-efs-csi-driver"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # module.eks[0].aws_eks_addon.kube_proxy will be created
  + resource "aws_eks_addon" "kube_proxy" {
      + addon_name                  = "kube-proxy"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "goldenpath-dev-eks-15-01-26-15"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-15-01-26-15-kube-proxy"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                    = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-15-01-26-15-kube-proxy"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # module.eks[0].aws_eks_addon.snapshot_controller[0] will be created
  + resource "aws_eks_addon" "snapshot_controller" {
      + addon_name                  = "snapshot-controller"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "goldenpath-dev-eks-15-01-26-15"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-15-01-26-15-snapshot-controller"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                    = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-15-01-26-15-snapshot-controller"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # module.eks[0].aws_eks_addon.vpc_cni will be created
  + resource "aws_eks_addon" "vpc_cni" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "goldenpath-dev-eks-15-01-26-15"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-15-01-26-15-vpc-cni"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                    = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-15-01-26-15-vpc-cni"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # module.eks[0].aws_eks_cluster.this will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "goldenpath-dev-eks-15-01-26-15"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                      = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + version                       = "1.29"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = true
        }

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks[0].aws_eks_node_group.this will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "goldenpath-dev-eks-15-01-26-15"
      + disk_size              = 20
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "dev-default"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "BuildId"                                                  = "15-01-26-15"
          + "Environment"                                              = "dev"
          + "Lifecycle"                                                = "ephemeral"
          + "ManagedBy"                                                = "terraform"
          + "Owner"                                                    = "platform-team"
          + "Project"                                                  = "goldenpath-idp"
          + "k8s.io/cluster-autoscaler/enabled"                        = "true"
          + "k8s.io/cluster-autoscaler/goldenpath-dev-eks-15-01-26-15" = "owned"
        }
      + tags_all               = {
          + "BuildId"                                                  = "15-01-26-15"
          + "Environment"                                              = "dev"
          + "Lifecycle"                                                = "ephemeral"
          + "ManagedBy"                                                = "terraform"
          + "Owner"                                                    = "platform-team"
          + "Project"                                                  = "goldenpath-idp"
          + "k8s.io/cluster-autoscaler/enabled"                        = "true"
          + "k8s.io/cluster-autoscaler/goldenpath-dev-eks-15-01-26-15" = "owned"
        }
      + version                = (known after apply)

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 6
          + max_size     = 8
          + min_size     = 6
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks[0].aws_iam_openid_connect_provider.this will be created
  + resource "aws_iam_openid_connect_provider" "this" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-15-01-26-15-oidc-provider"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all        = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-15-01-26-15-oidc-provider"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks[0].aws_iam_role.cluster will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-dev-eks-15-01-26-15-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-15-01-26-15-cluster-role"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-15-01-26-15-cluster-role"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks[0].aws_iam_role.node_group will be created
  + resource "aws_iam_role" "node_group" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-dev-eks-15-01-26-15-node-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-15-01-26-15-node-role"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-15-01-26-15-node-role"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks[0].aws_iam_role_policy_attachment.cluster["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "cluster" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "goldenpath-dev-eks-15-01-26-15-cluster-role"
    }

  # module.eks[0].aws_iam_role_policy_attachment.cluster["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "cluster" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "goldenpath-dev-eks-15-01-26-15-cluster-role"
    }

  # module.eks[0].aws_iam_role_policy_attachment.node_group["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "node_group" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "goldenpath-dev-eks-15-01-26-15-node-role"
    }

  # module.eks[0].aws_iam_role_policy_attachment.node_group["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "node_group" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "goldenpath-dev-eks-15-01-26-15-node-role"
    }

  # module.eks[0].aws_iam_role_policy_attachment.node_group["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "node_group" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "goldenpath-dev-eks-15-01-26-15-node-role"
    }

  # module.eks[0].aws_iam_role_policy_attachment.node_group["arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "node_group" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
      + role       = "goldenpath-dev-eks-15-01-26-15-node-role"
    }

  # module.eks[0].aws_security_group.cluster will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS cluster control plane"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "goldenpath-dev-eks-15-01-26-15-cluster-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-15-01-26-15-cluster-sg"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all               = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-15-01-26-15-cluster-sg"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + vpc_id                 = (known after apply)
    }

  # module.iam[0].data.aws_iam_policy_document.cluster_autoscaler_assume[0] will be read during apply
  # (config refers to values not yet known)
 &lt;= data "aws_iam_policy_document" "cluster_autoscaler_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:cluster-autoscaler",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam[0].data.aws_iam_policy_document.eso[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 &lt;= data "aws_iam_policy_document" "eso" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:DescribeSecret",
              + "secretsmanager:GetResourcePolicy",
              + "secretsmanager:GetSecretValue",
              + "secretsmanager:ListSecretVersionIds",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:secretsmanager:*:*:secret:goldenpath*",
            ]
        }
    }

  # module.iam[0].data.aws_iam_policy_document.eso_assume[0] will be read during apply
  # (config refers to values not yet known)
 &lt;= data "aws_iam_policy_document" "eso_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:external-secrets:external-secrets",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam[0].data.aws_iam_policy_document.lb_controller_assume[0] will be read during apply
  # (config refers to values not yet known)
 &lt;= data "aws_iam_policy_document" "lb_controller_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-load-balancer-controller",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam[0].aws_iam_policy.eso[0] will be created
  + resource "aws_iam_policy" "eso" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for External Secrets Operator."
      + id               = (known after apply)
      + name             = "goldenpath-idp-eso-role-15-01-26-15-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all         = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # module.iam[0].aws_iam_role.cluster_autoscaler[0] will be created
  + resource "aws_iam_role" "cluster_autoscaler" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-idp-cluster-autoscaler-15-01-26-15"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam[0].aws_iam_role.eks_cluster will be created
  + resource "aws_iam_role" "eks_cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-dev-eks-cluster-role-15-01-26-15"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam[0].aws_iam_role.eks_node_group will be created
  + resource "aws_iam_role" "eks_node_group" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-dev-eks-node-role-15-01-26-15"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam[0].aws_iam_role.eso[0] will be created
  + resource "aws_iam_role" "eso" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-idp-eso-role-15-01-26-15"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam[0].aws_iam_role.lb_controller[0] will be created
  + resource "aws_iam_role" "lb_controller" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-idp-aws-load-balancer-controller-15-01-26-15"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam[0].aws_iam_role_policy_attachment.cluster_autoscaler[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_autoscaler" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::593517239005:policy/golden-path-cluster-autoscaler-policy"
      + role       = "goldenpath-idp-cluster-autoscaler-15-01-26-15"
    }

  # module.iam[0].aws_iam_role_policy_attachment.eks_cluster_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cluster_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "goldenpath-dev-eks-cluster-role-15-01-26-15"
    }

  # module.iam[0].aws_iam_role_policy_attachment.eks_vpc_resource_controller will be created
  + resource "aws_iam_role_policy_attachment" "eks_vpc_resource_controller" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "goldenpath-dev-eks-cluster-role-15-01-26-15"
    }

  # module.iam[0].aws_iam_role_policy_attachment.eso[0] will be created
  + resource "aws_iam_role_policy_attachment" "eso" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "goldenpath-idp-eso-role-15-01-26-15"
    }

  # module.iam[0].aws_iam_role_policy_attachment.lb_controller[0] will be created
  + resource "aws_iam_role_policy_attachment" "lb_controller" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::593517239005:policy/goldenpath-load-balancer-controller-policy"
      + role       = "goldenpath-idp-aws-load-balancer-controller-15-01-26-15"
    }

  # module.platform_rds[0].aws_db_instance.this will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-04:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = true
      + database_insights_mode                = (known after apply)
      + db_name                               = "platform"
      + db_subnet_group_name                  = "goldenpath-dev-goldenpath-platform-db-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + enabled_cloudwatch_logs_exports       = [
          + "postgresql",
          + "upgrade",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "15.15"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "goldenpath-dev-goldenpath-platform-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:04:00-mon:05:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 50
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "goldenpath-dev-goldenpath-platform-db-params"
      + password                              = (sensitive value)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-goldenpath-platform-db"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                              = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-goldenpath-platform-db"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + timezone                              = (known after apply)
      + username                              = "postgres"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.platform_rds[0].aws_db_parameter_group.this[0] will be created
  + resource "aws_db_parameter_group" "this" {
      + arn          = (known after apply)
      + description  = "Parameter group for goldenpath-dev-goldenpath-platform-db"
      + family       = "postgres15"
      + id           = (known after apply)
      + name         = "goldenpath-dev-goldenpath-platform-db-params"
      + name_prefix  = (known after apply)
      + skip_destroy = false
      + tags         = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all     = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "log_min_duration_statement"
          + value        = "1000"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "rds.force_ssl"
          + value        = "1"
        }
    }

  # module.platform_rds[0].aws_db_subnet_group.this[0] will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "Subnet group for goldenpath-dev-goldenpath-platform-db RDS instance"
      + id                      = (known after apply)
      + name                    = "goldenpath-dev-goldenpath-platform-db-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-goldenpath-platform-db-subnet-group"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-goldenpath-platform-db-subnet-group"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + vpc_id                  = (known after apply)
    }

  # module.platform_rds[0].aws_secretsmanager_secret.app["backstage"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + description                    = "Database credentials for backstage application"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "goldenpath/dev/backstage/postgres"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                       = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }

      + replica (known after apply)
    }

  # module.platform_rds[0].aws_secretsmanager_secret.app["keycloak"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + description                    = "Database credentials for keycloak application"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "goldenpath/dev/keycloak/postgres"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                       = {
          + "BuildId"     = "15-01-26-15"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }

      + replica (known after apply)
  </pre>\n</details>\n_Truncated to 65k characters._\n> Merging this PR will trigger auto-apply to dev.